src/test/resources/performancetest/spike_test_aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
POST submit (valid),4392,2,2,3,3,3,0,8,0.000%,27.99592,9.32,5.73
POST submit (invalid - blank answer),94,2,3,3,4,7,1,7,0.000%,.75913,0.19,0.15
POST submit (invalid - unknown quiz id),66,1,2,3,3,3,1,3,0.000%,.73806,0.24,0.19
TOTAL,4552,2,2,3,3,3,0,8,0.000%,29.00841,9.60,5.96